Revit 2024 API
AnalysisDisplayStyle.HasMarkersAndTextSettings Method
 If true style has markers and text settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool HasMarkersAndTextSettings()
Visual Basic
Public Function HasMarkersAndTextSettings As Boolean
Visual C++
public:
bool HasMarkersAndTextSettings()
See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace